/* Задача 39: Напишите программу, которая перевернёт 
одномерный массив (последний элемент будет на первом месте,
 а первый - на последнем и т.д.) 

 [1 2 3 4 5] -> [5 4 3 2 1]
[6 7 3 6] -> [6 3 7 6]*/

//Создать массив с помощью создания другого массива 
// заполнения нового цифрами старого 

int[] array = new int[20] {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20};
for (int i = 0 ; i < array.Length/2; i++)
{
    int temp = array[i];
    array[i] = array[(array.Length - 1) - i];
    array[(array.Length - 1) - i] = temp;
}    
Console.WriteLine(string.Join(",", array));
